In [3]:
import pandas as pd

In [4]:
salary_data = pd.read_csv('Salary_Data.csv')
salary_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6704 entries, 0 to 6703
Data columns (total 6 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Age                  6702 non-null   float64
 1   Gender               6702 non-null   object
 2   Education Level      6701 non-null   object
 3   Job Title            6702 non-null   object
 4   Years of Experience  6701 non-null   float64
 5   Salary               6699 non-null   float64
dtypes: float64(3), object(3)
memory usage: 314.4+ KB

In [5]:
salary_data.head()

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0

In [6]:
salary_data.dropna(inplace=True)

In [7]:
salary_data[5000:6000]

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
5004,29.0,Male,Bachelor's Degree,Senior Product Marketing Manager,6.0,100000.0
5005,35.0,Female,PhD,Director of Marketing,12.0,170000.0
5006,27.0,Male,High School,Sales Representative,3.0,50000.0
5007,33.0,Female,Bachelor's Degree,Marketing Manager,9.0,140000.0
5008,30.0,Male,Master's Degree,Financial Manager,7.0,120000.0
...,...,...,...,...,...,...
6000,34.0,Male,PhD,Research Director,11.0,160000.0
6001,28.0,Female,Bachelor's Degree,Marketing Analyst,3.0,60000.0
6002,32.0,Male,Bachelor's Degree,Product Manager,7.0,120000.0
6003,24.0,Female,High School,Receptionist,0.0,25000.0
6004,37.0,Male,Master's Degree,Marketing Director,14.0,190000.0

In [8]:
salary_data['Education Level'].unique()

array(["Bachelor's", "Master's", 'PhD', "Bachelor's Degree",
       "Master's Degree", 'High School', 'phD'], dtype=object)

In [9]:
degree = {'phD': 'PhD', 'Bachelor\'s Degree' : 'Bachelor\'s', 'Master\'s Degree' : 'Masters','Bachelor\'s' : 'Bachelors', 'Master\'s' : 'Masters'}
salary_data['Education Level'].replace(degree, inplace=True)

In [10]:
degree_to_number = {'PhD': 3, 'Masters' : 2, 'Bachelors' : 1, 'High School' : 0}
salary_data['Education Level'].replace(degree_to_number, inplace=True)

In [11]:
salary_data['Salary'] = salary_data['Salary'].astype(int)
salary_data['Age'] = salary_data['Age'].astype('int8', errors='ignore')
salary_data['Years of Experience'] = salary_data['Years of Experience'].astype('int8', errors='ignore')

In [12]:
salary_data.head()

   Age  Gender Education Level          Job Title  Years of Experience  Salary
0   32    Male               1  Software Engineer                    5   90000
1   28  Female               2       Data Analyst                    3   65000
2   45    Male               3     Senior Manager                   15  150000
3   36  Female               1    Sales Associate                    7   60000
4   52    Male               2           Director                   20  200000

In [13]:
salary_data.describe()

               Age  Years of Experience         Salary
count  6698.000000          6698.000000    6698.000000
mean     33.623022             8.094207  115329.253061
std       7.615784             6.061399   52789.792507
min      21.000000             0.000000     350.000000
25%      28.000000             3.000000   70000.000000
50%      32.000000             7.000000  115000.000000
75%      38.000000            12.000000  160000.000000
max      62.000000            34.000000  250000.000000

In [19]:
from sklearn.svm import SVR
from sklearn.model_selection import train_test_split
from sklearn.metrics import mean_absolute_error, mean_squared_error

In [16]:
X = salary_data[['Gender', 'Age', 'Education Level', 'Years of Experience']]
Y = salary_data['Salary']

In [17]:
features = pd.get_dummies(X, drop_first=True)
X_train, X_test, Y_train, Y_test = train_test_split(features, Y, test_size=0.2, random_state=0)

In [18]:
SVR_linear = SVR(kernel='linear')
SVR_linear.fit(X_train, Y_train)

SVR(kernel='linear')

In [20]:
Y_pred = SVR_linear.predict(X_test)
print('Mean Absolute Error: ', mean_absolute_error(Y_test, Y_pred))
print('Mean Squared Error: ', mean_squared_error(Y_test, Y_pred))

Mean Absolute Error:  25407.43877249268
Mean Squared Error:  1047331696.3918709